Estrallas/STM32-RC522------Nake-/HARDWARE/OLED/oled.c

/***************************************************************************************
  * ?????????????????
  * ?????????????,???????????
  * ???????????,??????????????
  * 
  * ????:				0.96?OLED???????(4??I2C??)
  * ??????:			2023.10.24
  * ??????:			V1.2
  * ????????:		2024.4.24
  * 
  * ????????:		jiangxiekeji.com
  * ?????????:	jiangxiekeji.taobao.com
  * ?????????:	jiangxiekeji.com/tutorial/oled.html
  * 
  * ???????????????,??????????:feedback@jiangxiekeji.com
  * ??????,?????????????????,?????????,???????
  ***************************************************************************************
  */

#include "stm32f10x.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * ??????:
  * ??8?,????,?????,?????
  * ???Bit???????
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * ?????:
  * ????(0, 0)?
  * ?????X?,????:0~127
  * ?????Y?,????:0~63
  * 
  *       0             X?           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y? |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*????*********************/

/**
  * OLED????
  * ???????,?????????????
  * ????OLED_Update???OLED_UpdateArea??
  * ?????????????OLED??,????
  */
uint8_t OLED_DisplayBuf[8][128];

/*********************????*/


/*????*********************/

/**
  * ?    ?:OLED?SCL????
  * ?    ?:???SCL????,??:0/1
  * ? ? ?:?
  * ?    ?:????????SCL?,???????
  *           ????????????,?SCL??????????
  *           ?????0?,?SCL????,?????1?,?SCL????
  */
void OLED_W_SCL(uint8_t BitValue)
{
	/*??BitValue??,?SCL?????????*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_8, (BitAction)BitValue);
	
	/*?????????,?????????,?????I2C???????*/
	//...
}

/**
  * ?    ?:OLED?SDA????
  * ?    ?:???SDA????,??:0/1
  * ? ? ?:?
  * ?    ?:????????SDA?,???????
  *           ????????????,?SDA??????????
  *           ?????0?,?SDA????,?????1?,?SDA????
  */
void OLED_W_SDA(uint8_t BitValue)
{
	/*??BitValue??,?SDA?????????*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_9, (BitAction)BitValue);
	
	/*?????????,?????????,?????I2C???????*/
	//...
}

/**
  * ?    ?:OLED?????
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:???????????,???????
  *           ?????SCL?SDA??????????,?????
  */
void OLED_GPIO_Init(void)
{
	uint32_t i, j;
	
	/*?????,??????,?OLED????*/
	for (i = 0; i < 1000; i ++)
	{
		for (j = 0; j < 1000; j ++);
	}
	
	/*?SCL?SDA??????????*/
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	/*??SCL?SDA*/
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/*********************????*/


/*????*********************/

/**
  * ?    ?:I2C??
  * ?    ?:?
  * ? ? ?:?
  */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);		//??SDA,??SDA????
	OLED_W_SCL(1);		//??SCL,??SCL????
	OLED_W_SDA(0);		//?SCL?????,??SDA,??????
	OLED_W_SCL(0);		//????SCL???,???????,????????????
}

/**
  * ?    ?:I2C??
  * ?    ?:?
  * ? ? ?:?
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);		//??SDA,??SDA????
	OLED_W_SCL(1);		//??SCL,?SCL?????
	OLED_W_SDA(1);		//?SCL?????,??SDA,??????
}

/**
  * ?    ?:I2C??????
  * ?    ?:Byte ??????????,??:0x00~0xFF
  * ? ? ?:?
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	
	/*??8?,????????????*/
	for (i = 0; i < 8; i++)
	{
		/*?????????Byte???????????SDA?*/
		/*??!????,?????????1*/
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1);	//??SCL,???SCL???????SDA
		OLED_W_SCL(0);	//??SCL,???????????
	}
	
	OLED_W_SCL(1);		//???????,???????
	OLED_W_SCL(0);
}

/**
  * ?    ?:OLED???
  * ?    ?:Command ???????,??:0x00~0xFF
  * ? ? ?:?
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();				//I2C??
	OLED_I2C_SendByte(0x78);		//??OLED?I2C????
	OLED_I2C_SendByte(0x00);		//????,?0x00,???????
	OLED_I2C_SendByte(Command);		//???????
	OLED_I2C_Stop();				//I2C??
}

/**
  * ?    ?:OLED???
  * ?    ?:Data ??????????
  * ?    ?:Count ????????
  * ? ? ?:?
  */
void OLED_WriteData(uint8_t *Data, uint8_t Count)
{
	uint8_t i;
	
	OLED_I2C_Start();				//I2C??
	OLED_I2C_SendByte(0x78);		//??OLED?I2C????
	OLED_I2C_SendByte(0x40);		//????,?0x40,???????
	/*??Count?,?????????*/
	for (i = 0; i < Count; i ++)
	{
		OLED_I2C_SendByte(Data[i]);	//????Data??????
	}
	OLED_I2C_Stop();				//I2C??
}

/*********************????*/


/*????*********************/

/**
  * ?    ?:OLED???
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:???,??????????
  */
void OLED_Init(void)
{
	OLED_GPIO_Init();			//???????????
	
	/*????????,?OLED???????*/
	OLED_WriteCommand(0xAE);	//??????/??,0xAE??,0xAF??
	
	OLED_WriteCommand(0xD5);	//?????????/?????
	OLED_WriteCommand(0x80);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8);	//???????
	OLED_WriteCommand(0x3F);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3);	//??????
	OLED_WriteCommand(0x00);	//0x00~0x7F
	
	OLED_WriteCommand(0x40);	//???????,0x40~0x7F
	
	OLED_WriteCommand(0xA1);	//??????,0xA1??,0xA0????
	
	OLED_WriteCommand(0xC8);	//??????,0xC8??,0xC0????

	OLED_WriteCommand(0xDA);	//??COM??????
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//?????
	OLED_WriteCommand(0xCF);	//0x00~0xFF

	OLED_WriteCommand(0xD9);	//???????
	OLED_WriteCommand(0xF1);

