Estrallas/STM32-RC522------Nake-/HARDWARE/OLED/oled.c
	OLED_WriteCommand(0xDB);	//??VCOMH??????
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//????????/??

	OLED_WriteCommand(0xA6);	//????/????,0xA6??,0xA7??

	OLED_WriteCommand(0x8D);	//?????
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//????
	
	OLED_Clear();				//??????
	OLED_Update();				//????,??,??????????????
}

/**
  * ?    ?:OLED????????
  * ?    ?:Page ????????,??:0~7
  * ?    ?:X ???????X???,??:0~127
  * ? ? ?:?
  * ?    ?:OLED???Y?,??8?Bit?????,?1???8?Y???
  */
void OLED_SetCursor(uint8_t Page, uint8_t X)
{
	/*?????????1.3??OLED???,????????*/
	/*??1.3??OLED????(SH1106)?132?*/
	/*??????????2?,????0?*/
	/*?????X?2,??????*/
//	X += 2;
	
	/*?????????????*/
	OLED_WriteCommand(0xB0 | Page);					//?????
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//??X???4?
	OLED_WriteCommand(0x00 | (X & 0x0F));			//??X???4?
}

/*********************????*/


/*????*********************/

/*??????????????*/

/**
  * ?    ?:????
  * ?    ?:X ??
  * ?    ?:Y ??
  * ? ? ?:??X?Y??
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;	//?????1
	while (Y --)			//??Y?
	{
		Result *= X;		//???X??????
	}
	return Result;
}

/**
  * ?    ?:???????????????
  * ?    ?:nvert ???????
  * ?    ?:vertx verty ????????x?y?????
  * ?    ?:testx testy ????X?y??
  * ? ? ?:?????????????,1:???,0:????
  */
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	/*????W. Randolph Franklin??*/
	/*????:https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/**
  * ?    ?:??????????????
  * ?    ?:X Y ??????
  * ?    ?:StartAngle EndAngle ?????????,??:-180~180
  *           ?????0?,?????180??-180?,?????,?????,?????
  * ? ? ?:????????????,1:???,0:????
  */
uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
{
	int16_t PointAngle;
	PointAngle = atan2(Y, X) / 3.14 * 180;	//????????,????????
	if (StartAngle < EndAngle)	//?????????????
	{
		/*???????????????,???????????*/
		if (PointAngle >= StartAngle && PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	else			//??????????????
	{
		/*????????????????????,???????????*/
		if (PointAngle >= StartAngle || PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	return 0;		//???????,??????????????
}

/*********************????*/


/*????*********************/

/**
  * ?    ?:?OLED???????OLED??
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:???????,????OLED????????
  *           ????OLED_Update???OLED_UpdateArea??
  *           ?????????????OLED??,????
  *           ????????,???????????,????????
  */
void OLED_Update(void)
{
	uint8_t j;
	/*?????*/
	for (j = 0; j < 8; j ++)
	{
		/*??????????????*/
		OLED_SetCursor(j, 0);
		/*????128???,???????????OLED??*/
		OLED_WriteData(OLED_DisplayBuf[j], 128);
	}
}

/**
  * ?    ?:?OLED?????????OLED??
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Width ???????,??:0~128
  * ?    ?:Height ???????,??:0~64
  * ? ? ?:?
  * ?    ?:???????????????
  *           ??????Y???????,????????????????
  * ?    ?:???????,????OLED????????
  *           ????OLED_Update???OLED_UpdateArea??
  *           ?????????????OLED??,????
  *           ????????,???????????,????????
  */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t j;
	int16_t Page, Page1;
	
	/*??????????????????*/
	/*(Y + Height - 1) / 8 + 1????(Y + Height) / 8?????*/
	Page = Y / 8;
	Page1 = (Y + Height - 1) / 8 + 1;
	if (Y < 0)
	{
		Page -= 1;
		Page1 -= 1;
	}
	
	/*????????????*/
	for (j = Page; j < Page1; j ++)
	{
		if (X >= 0 && X <= 127 && j >= 0 && j <= 7)		//??????????
		{
			/*??????????????*/
			OLED_SetCursor(j, X);
			/*????Width???,???????????OLED??*/
			OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
		}
	}
}

/**
  * ?    ?:?OLED????????
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//??8?
	{
		for (i = 0; i < 128; i ++)			//??128?
		{
			OLED_DisplayBuf[j][i] = 0x00;	//???????????
		}
	}
}

/**
  * ?    ?:?OLED????????
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Width ???????,??:0~128
  * ?    ?:Height ???????,??:0~64
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//?????
	{
		for (i = X; i < X + Width; i ++)	//?????
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)				//??????????
			{
				OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8));	//???????????
			}
		}
	}
}

/**
  * ?    ?:?OLED????????
  * ?    ?:?
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_Reverse(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//??8?
	{
		for (i = 0; i < 128; i ++)			//??128?
		{
			OLED_DisplayBuf[j][i] ^= 0xFF;	//???????????
		}
	}
}
	
/**
  * ?    ?:?OLED????????
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Width ???????,??:0~128
  * ?    ?:Height ???????,??:0~64
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//?????
	{
		for (i = X; i < X + Width; i ++)	//?????
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)			//??????????
			{
				OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8);	//???????????
			}
		}
	}
}

/**
  * ?    ?:OLED??????
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Char ????????,??:ASCII?????
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
{
	if (FontSize == OLED_8X16)		//????8??,?16??
	{
		/*?ASCII???OLED_F8x16??????8*16???????*/
		OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
	}
	else if(FontSize == OLED_6X8)	//????6??,?8??
	{
		/*?ASCII???OLED_F6x8??????6*8???????*/
		OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
	}
}

/**
  * ?    ?:OLED?????
  * ?    ?:X ????????????,??:-32768~32767,????:0~127
  * ?    ?:Y ????????????,??:-32768~32767,????:0~63
  * ?    ?:String ?????????,??:ASCII???????????
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)		//??????????
	{
		/*??OLED_ShowChar??,????????*/
		OLED_ShowChar(X + i * FontSize, Y, String[i], FontSize);
	}
}

/**
  * ?    ?:OLED????(???,???)
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Number ????????,??:0~4294967295
  * ?    ?:Length ???????,??:0~10
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//????????							
	{
		/*??OLED_ShowChar??,????????*/
		/*Number / OLED_Pow(10, Length - i - 1) % 10 ?????????????*/
		/*+ '0' ???????????*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * ?    ?:OLED???????(???,??)
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Number ????????,??:-2147483648~2147483647
  * ?    ?:Length ???????,??:0~10
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	uint32_t Number1;
	
	if (Number >= 0)						//??????0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//??+?
		Number1 = Number;					//Number1????Number
	}
	else									//????0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//??-?
		Number1 = -Number;					//Number1??Number??
	}
	
	for (i = 0; i < Length; i++)			//????????								
	{
		/*??OLED_ShowChar??,????????*/
		/*Number1 / OLED_Pow(10, Length - i - 1) % 10 ?????????????*/
		/*+ '0' ???????????*/
		OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * ?    ?:OLED????????(????,???)
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Number ????????,??:0x00000000~0xFFFFFFFF
  * ?    ?:Length ???????,??:0~8
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)		//????????
	{
		/*?????????????*/
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		
