Estrallas/STM32-RC522------Nake-/HARDWARE/OLED/oled.c
		if (SingleNumber < 10)			//??????10
		{
			/*??OLED_ShowChar??,?????*/
			/*+ '0' ???????????*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
		}
		else							//??????10
		{
			/*??OLED_ShowChar??,?????*/
			/*+ 'A' ????????A?????????*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
		}
	}
}

/**
  * ?    ?:OLED???????(???,???)
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Number ????????,??:0x00000000~0xFFFFFFFF
  * ?    ?:Length ???????,??:0~16
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//????????	
	{
		/*??OLED_ShowChar??,????????*/
		/*Number / OLED_Pow(2, Length - i - 1) % 2 ?????????????*/
		/*+ '0' ???????????*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
	}
}

/**
  * ?    ?:OLED??????(???,??)
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Number ????????,??:-4294967295.0~4294967295.0
  * ?    ?:IntLength ??????????,??:0~10
  * ?    ?:FraLength ??????????,??:0~9,??????????
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
	uint32_t PowNum, IntNum, FraNum;
	
	if (Number >= 0)						//??????0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//??+?
	}
	else									//????0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//??-?
		Number = -Number;					//Number??
	}
	
	/*???????????*/
	IntNum = Number;						//?????????,????
	Number -= IntNum;						//?Number?????,????????????????????
	PowNum = OLED_Pow(10, FraLength);		//?????????,????
	FraNum = round(Number * PowNum);		//???????,??????,??????
	IntNum += FraNum / PowNum;				//??????????,????????
	
	/*??????*/
	OLED_ShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);
	
	/*?????*/
	OLED_ShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);
	
	/*??????*/
	OLED_ShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
  * ?    ?:OLED?????
  * ?    ?:X ????????????,??:-32768~32767,????:0~127
  * ?    ?:Y ????????????,??:-32768~32767,????:0~63
  * ?    ?:Chinese ?????????,??:?????????????,??????????
  *           ????????OLED_Data.c??OLED_CF16x16????
  *           ????????,???????(????,??????)
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowChinese(int16_t X, int16_t Y, char *Chinese)
{
	uint8_t pChinese = 0;
	uint8_t pIndex;
	uint8_t i;
	char SingleChinese[OLED_CHN_CHAR_WIDTH + 1] = {0};
	
	for (i = 0; Chinese[i] != '\0'; i ++)		//?????
	{
		SingleChinese[pChinese] = Chinese[i];	//??????????????
		pChinese ++;							//????
		
		/*???????OLED_CHN_CHAR_WIDTH?,??????????????*/
		if (pChinese >= OLED_CHN_CHAR_WIDTH)
		{
			pChinese = 0;		//????
			
			/*?????????,???????*/
			/*??????????(???????),????????????,????*/
			for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex ++)
			{
				/*???????*/
				if (strcmp(OLED_CF16x16[pIndex].Index, SingleChinese) == 0)
				{
					break;		//????,??pIndex??????????
				}
			}
			
			/*??????OLED_CF16x16??????16*16???????*/
			OLED_ShowImage(X + ((i + 1) / OLED_CHN_CHAR_WIDTH - 1) * 16, Y, 16, 16, OLED_CF16x16[pIndex].Data);
		}
	}
}

/**
  * ?    ?:OLED????
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Width ???????,??:0~128
  * ?    ?:Height ???????,??:0~64
  * ?    ?:Image ????????
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_ShowImage(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image)
{
	uint8_t i = 0, j = 0;
	int16_t Page, Shift;
	
	/*?????????*/
	OLED_ClearArea(X, Y, Width, Height);
	
	/*????????????*/
	/*(Height - 1) / 8 + 1????Height / 8?????*/
	for (j = 0; j < (Height - 1) / 8 + 1; j ++)
	{
		/*????????????*/
		for (i = 0; i < Width; i ++)
		{
			if (X + i >= 0 && X + i <= 127)		//??????????
			{
				/*?????????????????????*/
				Page = Y / 8;
				Shift = Y % 8;
				if (Y < 0)
				{
					Page -= 1;
					Shift += 8;
				}
				
				if (Page + j >= 0 && Page + j <= 7)		//??????????
				{
					/*???????????*/
					OLED_DisplayBuf[Page + j][X + i] |= Image[j * Width + i] << (Shift);
				}
				
				if (Page + j + 1 >= 0 && Page + j + 1 <= 7)		//??????????
				{					
					/*???????????*/
					OLED_DisplayBuf[Page + j + 1][X + i] |= Image[j * Width + i] >> (8 - Shift);
				}
			}
		}
	}
}

/**
  * ?    ?:OLED??printf??????????
  * ?    ?:X ???????????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????????,??:-32768~32767,????:0~63
  * ?    ?:FontSize ??????
  *           ??:OLED_8X16		?8??,?16??
  *                 OLED_6X8		?6??,?8??
  * ?    ?:format ????????????,??:ASCII???????????
  * ?    ?:... ??????????
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_Printf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
	char String[256];						//??????
	va_list arg;							//???????????????arg
	va_start(arg, format);					//?format??,???????arg??
	vsprintf(String, format, arg);			//??vsprintf???????????????????
	va_end(arg);							//????arg
	OLED_ShowString(X, Y, String, FontSize);//OLED??????(???)
}

/**
  * ?    ?:OLED?????????
  * ?    ?:X ???????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????,??:-32768~32767,????:0~63
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//??????????
	{
		/*????????????Bit???1*/
		OLED_DisplayBuf[Y / 8][X] |= 0x01 << (Y % 8);
	}
}

/**
  * ?    ?:OLED?????????
  * ?    ?:X ???????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????,??:-32768~32767,????:0~63
  * ? ? ?:?????????????,1:??,0:??
  */
uint8_t OLED_GetPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//??????????
	{
		/*?????????*/
		if (OLED_DisplayBuf[Y / 8][X] & 0x01 << (Y % 8))
		{
			return 1;	//?1,??1
		}
	}
	
	return 0;		//??,??0
}

/**
  * ?    ?:OLED??
  * ?    ?:X0 ??????????,??:-32768~32767,????:0~127
  * ?    ?:Y0 ??????????,??:-32768~32767,????:0~63
  * ?    ?:X1 ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y1 ???????????,??:-32768~32767,????:0~63
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawLine(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1)
{
	int16_t x, y, dx, dy, d, incrE, incrNE, temp;
	int16_t x0 = X0, y0 = Y0, x1 = X1, y1 = Y1;
	uint8_t yflag = 0, xyflag = 0;
	
	if (y0 == y1)		//??????
	{
		/*0??X????1??X??,?????X??*/
		if (x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
		
