Estrallas/STM32-RC522------Nake-/HARDWARE/OLED/oled.c
		/*??X??*/
		for (x = x0; x <= x1; x ++)
		{
			OLED_DrawPoint(x, y0);	//????
		}
	}
	else if (x0 == x1)	//??????
	{
		/*0??Y????1??Y??,?????Y??*/
		if (y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
		
		/*??Y??*/
		for (y = y0; y <= y1; y ++)
		{
			OLED_DrawPoint(x0, y);	//????
		}
	}
	else				//??
	{
		/*??Bresenham?????,???????????,????*/
		/*????:https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
		/*????:https://www.bilibili.com/video/BV1364y1d7Lo*/
		
		if (x0 > x1)	//0??X????1??X??
		{
			/*??????*/
			/*????????,?????????????????????????*/
			temp = x0; x0 = x1; x1 = temp;
			temp = y0; y0 = y1; y1 = temp;
		}
		
		if (y0 > y1)	//0??Y????1??Y??
		{
			/*?Y????*/
			/*???????,???????????????????*/
			y0 = -y0;
			y1 = -y1;
			
			/*????yflag,??????,????????,???????*/
			yflag = 1;
		}
		
		if (y1 - y0 > x1 - x0)	//??????1
		{
			/*?X???Y????*/
			/*???????,???????????0~90?????????0~45???*/
			temp = x0; x0 = y0; y0 = temp;
			temp = x1; x1 = y1; y1 = temp;
			
			/*????xyflag,??????,????????,???????*/
			xyflag = 1;
		}
		
		/*???Bresenham?????*/
		/*????,???????????0~45???*/
		dx = x1 - x0;
		dy = y1 - y0;
		incrE = 2 * dy;
		incrNE = 2 * (dy - dx);
		d = 2 * dy - dx;
		x = x0;
		y = y0;
		
		/*????,???????,??????*/
		if (yflag && xyflag){OLED_DrawPoint(y, -x);}
		else if (yflag)		{OLED_DrawPoint(x, -y);}
		else if (xyflag)	{OLED_DrawPoint(y, x);}
		else				{OLED_DrawPoint(x, y);}
		
		while (x < x1)		//??X?????
		{
			x ++;
			if (d < 0)		//??????????
			{
				d += incrE;
			}
			else			//???????????
			{
				y ++;
				d += incrNE;
			}
			
			/*?????,???????,??????*/
			if (yflag && xyflag){OLED_DrawPoint(y, -x);}
			else if (yflag)		{OLED_DrawPoint(x, -y);}
			else if (xyflag)	{OLED_DrawPoint(y, x);}
			else				{OLED_DrawPoint(x, y);}
		}	
	}
}

/**
  * ?    ?:OLED??
  * ?    ?:X ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y ???????????,??:-32768~32767,????:0~63
  * ?    ?:Width ???????,??:0~128
  * ?    ?:Height ???????,??:0~64
  * ?    ?:IsFilled ????????
  *           ??:OLED_UNFILLED		???
  *                 OLED_FILLED			??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawRectangle(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, uint8_t IsFilled)
{
	int16_t i, j;
	if (!IsFilled)		//???????
	{
		/*????X??,????????*/
		for (i = X; i < X + Width; i ++)
		{
			OLED_DrawPoint(i, Y);
			OLED_DrawPoint(i, Y + Height - 1);
		}
		/*????Y??,????????*/
		for (i = Y; i < Y + Height; i ++)
		{
			OLED_DrawPoint(X, i);
			OLED_DrawPoint(X + Width - 1, i);
		}
	}
	else				//??????
	{
		/*??X??*/
		for (i = X; i < X + Width; i ++)
		{
			/*??Y??*/
			for (j = Y; j < Y + Height; j ++)
			{
				/*???????,?????*/
				OLED_DrawPoint(i, j);
			}
		}
	}
}

/**
  * ?    ?:OLED???
  * ?    ?:X0 ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y0 ???????????,??:-32768~32767,????:0~63
  * ?    ?:X1 ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y1 ???????????,??:-32768~32767,????:0~63
  * ?    ?:X2 ???????????,??:-32768~32767,????:0~127
  * ?    ?:Y2 ???????????,??:-32768~32767,????:0~63
  * ?    ?:IsFilled ?????????
  *           ??:OLED_UNFILLED		???
  *                 OLED_FILLED			??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawTriangle(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1, int16_t X2, int16_t Y2, uint8_t IsFilled)
{
	int16_t minx = X0, miny = Y0, maxx = X0, maxy = Y0;
	int16_t i, j;
	int16_t vx[] = {X0, X1, X2};
	int16_t vy[] = {Y0, Y1, Y2};
	
	if (!IsFilled)			//????????
	{
		/*??????,?????????*/
		OLED_DrawLine(X0, Y0, X1, Y1);
		OLED_DrawLine(X0, Y0, X2, Y2);
		OLED_DrawLine(X1, Y1, X2, Y2);
	}
	else					//???????
	{
		/*????????X?Y??*/
		if (X1 < minx) {minx = X1;}
		if (X2 < minx) {minx = X2;}
		if (Y1 < miny) {miny = Y1;}
		if (Y2 < miny) {miny = Y2;}
		
		/*????????X?Y??*/
		if (X1 > maxx) {maxx = X1;}
		if (X2 > maxx) {maxx = X2;}
		if (Y1 > maxy) {maxy = Y1;}
		if (Y2 > maxy) {maxy = Y2;}
		
		/*?????????????????????*/
		/*??????????*/
		/*??X??*/		
		for (i = minx; i <= maxx; i ++)
		{
			/*??Y??*/	
			for (j = miny; j <= maxy; j ++)
			{
				/*??OLED_pnpoly,???????????????*/
				/*???,???,????,?????*/
				if (OLED_pnpoly(3, vx, vy, i, j)) {OLED_DrawPoint(i, j);}
			}
		}
	}
}

/**
  * ?    ?:OLED??
  * ?    ?:X ?????????,??:-32768~32767,????:0~127
  * ?    ?:Y ?????????,??:-32768~32767,????:0~63
  * ?    ?:Radius ??????,??:0~255
  * ?    ?:IsFilled ???????
  *           ??:OLED_UNFILLED		???
  *                 OLED_FILLED			??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawCircle(int16_t X, int16_t Y, uint8_t Radius, uint8_t IsFilled)
{
	int16_t x, y, d, j;
	
	/*??Bresenham????,???????????,????*/
	/*????:https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
	/*????:https://www.bilibili.com/video/BV1VM4y1u7wJ*/
	
	d = 1 - Radius;
	x = 0;
	y = Radius;
	
	/*?????????????*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X + y, Y + x);
	OLED_DrawPoint(X - y, Y - x);
	
	if (IsFilled)		//?????
	{
		/*?????Y??*/
		for (j = -y; j < y; j ++)
		{
			/*???????,?????*/
			OLED_DrawPoint(X, Y + j);
		}
	}
	
	while (x < y)		//??X?????
	{
		x ++;
		if (d < 0)		//??????????
		{
			d += 2 * x + 1;
		}
		else			//???????????
		{
			y --;
			d += 2 * (x - y) + 1;
		}
		
		/*???????????*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X + y, Y + x);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - y, Y - x);
		OLED_DrawPoint(X + x, Y - y);
		OLED_DrawPoint(X + y, Y - x);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X - y, Y + x);
		
		if (IsFilled)	//?????
		{
			/*??????*/
			for (j = -y; j < y; j ++)
			{
				/*???????,?????*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
			
			/*??????*/
			for (j = -x; j < x; j ++)
			{
				/*???????,?????*/
				OLED_DrawPoint(X - y, Y + j);
				OLED_DrawPoint(X + y, Y + j);
			}
		}
	}
}

/**
  * ?    ?:OLED???
  * ?    ?:X ??????????,??:-32768~32767,????:0~127
  * ?    ?:Y ??????????,??:-32768~32767,????:0~63
  * ?    ?:A ???????????,??:0~255
  * ?    ?:B ???????????,??:0~255
  * ?    ?:IsFilled ????????
  *           ??:OLED_UNFILLED		???
  *                 OLED_FILLED			??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawEllipse(int16_t X, int16_t Y, uint8_t A, uint8_t B, uint8_t IsFilled)
{
	int16_t x, y, j;
	int16_t a = A, b = B;
	float d1, d2;
	
	/*??Bresenham?????,?????????????,????*/
	/*????:https://blog.csdn.net/myf_666/article/details/128167392*/
	
