Estrallas/STM32-RC522------Nake-/HARDWARE/OLED/oled.c
	x = 0;
	y = b;
	d1 = b * b + a * a * (-b + 0.5);
	
	if (IsFilled)	//??????
	{
		/*?????Y??*/
		for (j = -y; j < y; j ++)
		{
			/*???????,??????*/
			OLED_DrawPoint(X, Y + j);
			OLED_DrawPoint(X, Y + j);
		}
	}
	
	/*????????*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X - x, Y + y);
	OLED_DrawPoint(X + x, Y - y);
	
	/*???????*/
	while (b * b * (x + 1) < a * a * (y - 0.5))
	{
		if (d1 <= 0)		//??????????
		{
			d1 += b * b * (2 * x + 3);
		}
		else				//???????????
		{
			d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
			y --;
		}
		x ++;
		
		if (IsFilled)	//??????
		{
			/*??????*/
			for (j = -y; j < y; j ++)
			{
				/*???????,??????*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*?????????*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
	
	/*???????*/
	d2 = b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;
	
	while (y > 0)
	{
		if (d2 <= 0)		//??????????
		{
			d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
			x ++;
			
		}
		else				//???????????
		{
			d2 += a * a * (-2 * y + 3);
		}
		y --;
		
		if (IsFilled)	//??????
		{
			/*??????*/
			for (j = -y; j < y; j ++)
			{
				/*???????,??????*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*?????????*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
}

/**
  * ?    ?:OLED???
  * ?    ?:X ??????????,??:-32768~32767,????:0~127
  * ?    ?:Y ??????????,??:-32768~32767,????:0~63
  * ?    ?:Radius ???????,??:0~255
  * ?    ?:StartAngle ?????????,??:-180~180
  *           ?????0?,?????180??-180?,?????,?????,?????
  * ?    ?:EndAngle ?????????,??:-180~180
  *           ?????0?,?????180??-180?,?????,?????,?????
  * ?    ?:IsFilled ????????,??????
  *           ??:OLED_UNFILLED		???
  *                 OLED_FILLED			??
  * ? ? ?:?
  * ?    ?:??????,???????????,????????
  */
void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
{
	int16_t x, y, d, j;
	
	/*?????Bresenham???????*/
	
	d = 1 - Radius;
	x = 0;
	y = Radius;
	
	/*????????,?????????????,?,???,??,?????*/
	if (OLED_IsInAngle(x, y, StartAngle, EndAngle))	{OLED_DrawPoint(X + x, Y + y);}
	if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
	if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
	if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
	
	if (IsFilled)	//??????
	{
		/*?????Y??*/
		for (j = -y; j < y; j ++)
		{
			/*?????????,?????????????,?,???,??,?????*/
			if (OLED_IsInAngle(0, j, StartAngle, EndAngle)) {OLED_DrawPoint(X, Y + j);}
		}
	}
	
	while (x < y)		//??X?????
	{
		x ++;
		if (d < 0)		//??????????
		{
			d += 2 * x + 1;
		}
		else			//???????????
		{
			y --;
			d += 2 * (x - y) + 1;
		}
		
		/*????????,?????????????,?,???,??,?????*/
		if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + y);}
		if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
		if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
		if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
		if (OLED_IsInAngle(x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y - y);}
		if (OLED_IsInAngle(y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y - x);}
		if (OLED_IsInAngle(-x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + y);}
		if (OLED_IsInAngle(-y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + x);}
		
		if (IsFilled)	//??????
		{
			/*??????*/
			for (j = -y; j < y; j ++)
			{
				/*?????????,?????????????,?,???,??,?????*/
				if (OLED_IsInAngle(x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + j);}
				if (OLED_IsInAngle(-x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + j);}
			}
			
			/*??????*/
			for (j = -x; j < x; j ++)
			{
				/*?????????,?????????????,?,???,??,?????*/
				if (OLED_IsInAngle(-y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + j);}
				if (OLED_IsInAngle(y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + j);}
			}
		}
	}
}

/*********************????*/


/*****************????|????****************/
/*****************jiangxiekeji.com*****************/
